In [75]:
import numpy as np
import pandas as pd

In [79]:
ser1 = pd.Series([1, 2, 3, 4, 5], name='A')
ser2 = pd.Series([1, 2, 3, 4, 5], name='B')

In [82]:
df = pd.concat([
    ser1,
    ser2
], axis=1)

In [87]:
pd.DataFrame([[1, 2, 3], 
              [4, 5, 6],
              [7, 8, 9]], columns=['A', 'B', 'C'], index=[5, 6, 7])

   A  B  C
5  1  2  3
6  4  5  6
7  7  8  9

In [122]:
df = pd.DataFrame({
    'name': ['Alex', 'Xela', 'Alexa'],
    'age': [12, 24, 36],
    'amount': [10.5, 21.0, 31.5]
}, index=['a', 'b', 'c'])

In [137]:
df['col'] = [1, 2, 3, 4]

In [131]:
df.loc['d'] = df.iloc[1]

In [143]:
df.drop('col', axis=1, inplace=True)

In [144]:
df

    name  age  amount
a   Alex   12    10.5
b   Xela   24    21.0
c  Alexa   36    31.5
d   Xela   24    21.0

ДатаФрейм с 5 строками (это первый столбец), каждая строка это какое-то устройство: ["Не mac", 'Не iPhone']
Второй столбец, должен содержать числа, [100, 200, 400, 800, 1600]: Цена
Третий столбец, количество устройств [5, 1, 2, 3, 4]
Четвертый столбец: произведение третьего и второго стобца - [500, 200, 800, 2400, 6400]

In [150]:
a = [(i** 2 *100) for i in range(1, 6)]
b =  np.random.randint(1, 10, 5)

In [151]:
pd.DataFrame({
    'devices': [f'samsunf{i}' for i in range(1, 6)],
    'price': a,
    'count': b,
    'sum_price': [i*ii for i, ii in zip(a, b)]})

    devices  price  count  sum_price
0  samsunf1    100      9        900
1  samsunf2    400      1        400
2  samsunf3    900      1        900
3  samsunf4   1600      3       4800
4  samsunf5   2500      1       2500